MBronsom/OfflineSWD/Firmware/keil_standard_f103_20200910/RL/USB/Drivers/usbh_stm32f40x.c
/*------------------------------------------------------------------------------
 *      RL-ARM - USB
 *------------------------------------------------------------------------------
 *      Name:    usbh_stm32f40x.c
 *      Purpose: High/Full/Low-speed Host STM32F40x Driver module
 *      Rev.:    V4.70
 *      Comment: Known issue in frequent connect/disconnect if transfer was 
 *               started but not ended before disconnect, cancel of transfer 
 *               never happens (channel never halts) (this is hardware issue)
 *------------------------------------------------------------------------------
 *      This code is part of the RealView Run-Time Library.
 *      Copyright (c) 2004-2013 KEIL - An ARM Company. All rights reserved.
 *----------------------------------------------------------------------------*/

#include <RTL.h>
#include <rl_usb.h>
#include "usbh_stm32f40x.h"
#include <stm32f4xx.h>
#include <string.h>


/************************** Host Controller Driver Structure ******************/

BOOL USBH0_STM32_Pins_Config (BOOL on)                    { return (USBH_STM32_Pins_Config (0, on)); }
BOOL USBH0_STM32_Init        (BOOL on)                    { return (USBH_STM32_Init        (0, on)); }
BOOL USBH0_STM32_Port_Power  (BOOL on)                    { return (USBH_STM32_Port_Power  (0, on)); }
BOOL USBH0_STM32_Port_Reset  (U8 port)                    { return (USBH_STM32_Port_Reset  (0, port)); }
U32  USBH0_STM32_Get_Connect (void)                       { return (USBH_STM32_Get_Connect (0)); }
U32  USBH0_STM32_Get_Speed   (void)                       { return (USBH_STM32_Get_Speed   (0)); }
U32  USBH0_STM32_EP_Add      (          U8 dev_adr, U8 ep_spd, USB_ENDPOINT_DESCRIPTOR *ptrEPD) { 
                                                            return (USBH_STM32_EP_Add      (0,       dev_adr, ep_spd, ptrEPD)); }
BOOL USBH0_STM32_EP_Config   (U32 hndl, U8 dev_adr, U8 ep_spd, USB_ENDPOINT_DESCRIPTOR *ptrEPD) { 
                                                            return (USBH_STM32_EP_Config   (0, hndl, dev_adr, ep_spd, ptrEPD)); }
BOOL USBH0_STM32_EP_Remove   (U32 hndl)                   { return (USBH_STM32_EP_Remove   (0, hndl)); }
BOOL USBH0_STM32_URB_Submit  (U32 hndl, USBH_URB *ptrURB) { return (USBH_STM32_URB_Submit  (0, hndl, ptrURB)); }
BOOL USBH0_STM32_URB_Cancel  (U32 hndl, USBH_URB *ptrURB) { return (USBH_STM32_URB_Cancel  (0, hndl, ptrURB)); }
void OTG_FS_IRQHandler       (void)                       { OTG_xS_IRQHandler              (0); }

BOOL USBH1_STM32_Pins_Config (BOOL on)                    { return (USBH_STM32_Pins_Config (1, on)); }
BOOL USBH1_STM32_Init        (BOOL on)                    { return (USBH_STM32_Init        (1, on)); }
BOOL USBH1_STM32_Port_Power  (BOOL on)                    { return (USBH_STM32_Port_Power  (1, on)); }
BOOL USBH1_STM32_Port_Reset  (U8 port)                    { return (USBH_STM32_Port_Reset  (1, port)); }
U32  USBH1_STM32_Get_Connect (void)                       { return (USBH_STM32_Get_Connect (1)); }
U32  USBH1_STM32_Get_Speed   (void)                       { return (USBH_STM32_Get_Speed   (1)); }
U32  USBH1_STM32_EP_Add      (          U8 dev_adr, U8 ep_spd, USB_ENDPOINT_DESCRIPTOR *ptrEPD) { 
                                                            return (USBH_STM32_EP_Add      (1,       dev_adr, ep_spd, ptrEPD)); }
BOOL USBH1_STM32_EP_Config   (U32 hndl, U8 dev_adr, U8 ep_spd, USB_ENDPOINT_DESCRIPTOR *ptrEPD) { 
                                                            return (USBH_STM32_EP_Config   (1, hndl, dev_adr, ep_spd, ptrEPD)); }
BOOL USBH1_STM32_EP_Remove   (U32 hndl)                   { return (USBH_STM32_EP_Remove   (1, hndl)); }
BOOL USBH1_STM32_URB_Submit  (U32 hndl, USBH_URB *ptrURB) { return (USBH_STM32_URB_Submit  (1, hndl, ptrURB)); }
BOOL USBH1_STM32_URB_Cancel  (U32 hndl, USBH_URB *ptrURB) { return (USBH_STM32_URB_Cancel  (1, hndl, ptrURB)); }
void OTG_HS_IRQHandler       (void)                       { OTG_xS_IRQHandler              (1); }

USBH_HCD usbh0_hcd = {                  /* Host Controller Driver structure   */
  USBH_STM32_Get_Capabilities,          /* Get Host Ctrl Driver capabilities  */
  USBH_STM32_Delay_ms,                  /* Delay in ms                        */
  USBH0_STM32_Pins_Config,              /* Config/Unconfig pins               */
  USBH0_STM32_Init,                     /* Init/Uninit Host Controller        */
  USBH0_STM32_Port_Power,               /* On/Off Port Power                  */
  USBH0_STM32_Port_Reset,               /* Reset port                         */
  USBH0_STM32_Get_Connect,              /* Get port conn/disconn status       */
  USBH0_STM32_Get_Speed,                /* Get port enumerated speed          */
  USBH0_STM32_EP_Add,                   /* Add Endpoint                       */
  USBH0_STM32_EP_Config,                /* (Re)Configure Endpoint             */
  USBH0_STM32_EP_Remove,                /* Remove Endpoint                    */
  USBH0_STM32_URB_Submit,               /* Submit USB Block Request           */
  USBH0_STM32_URB_Cancel                /* Cancel USB Block Request           */
};

USBH_HCD usbh1_hcd = {                  /* Host Controller Driver structure   */
  USBH_STM32_Get_Capabilities,          /* Get Host Ctrl Driver capabilities  */
  USBH_STM32_Delay_ms,                  /* Delay in ms                        */
  USBH1_STM32_Pins_Config,              /* Config/Unconfig pins               */
  USBH1_STM32_Init,                     /* Init/Uninit Host Controller        */
  USBH1_STM32_Port_Power,               /* On/Off Port Power                  */
  USBH1_STM32_Port_Reset,               /* Reset port                         */
  USBH1_STM32_Get_Connect,              /* Get port conn/disconn status       */
  USBH1_STM32_Get_Speed,                /* Get port enumerated speed          */
  USBH1_STM32_EP_Add,                   /* Add Endpoint                       */
  USBH1_STM32_EP_Config,                /* (Re)Configure Endpoint             */
  USBH1_STM32_EP_Remove,                /* Remove Endpoint                    */
  USBH1_STM32_URB_Submit,               /* Submit USB Block Request           */
  USBH1_STM32_URB_Cancel                /* Cancel USB Block Request           */
};


