MBronsom/OfflineSWD/Firmware/keil_standard_f103_20200910/RL/USB/Drivers/usbh_stm32f40x.c
/************************** Driver Settings ***********************************/

//-------- <<< Use Configuration Wizard in Context Menu >>> --------------------

//  <o0> Size of memory used by the OTG_FS USB Host Controller <1-1048576>
//  <i> This is a size of memory (in bytes) that the USB Host Controller 
//  <i> will use for USB communication data.
//
//  <o1> Size of memory used by the OTG_HS USB Host Controller <1-1048576>
//  <i> This is a size of memory (in bytes) that the USB Host Controller 
//  <i> will use for USB communication data.
#define USBH0_STM32_SZ_MPOOL        0x00000234
#define USBH1_STM32_SZ_MPOOL        0x00000234


/************************** Variable and Memory Definitons ********************/

typedef enum    {PORT_A = 0, PORT_B, PORT_C, PORT_D, PORT_E, PORT_F, PORT_G, PORT_H, PORT_I} PORTS;

#define MAX_TIMEOUT_COUNT         100
#define DEBOUNCE_500ms            500

#define OTG_FS_MAX_CH             8
#define OTG_HS_MAX_CH             16

static U32 *OTG[2]                      = { (U32 *)OTG_FS, (U32 *)OTG_HS };
static U32 *OTG_DFIFO[2][OTG_HS_MAX_CH] = { { OTG_FS_DFIFO0,  OTG_FS_DFIFO1, 
                                              OTG_FS_DFIFO2,  OTG_FS_DFIFO3, 
                                              OTG_FS_DFIFO4,  OTG_FS_DFIFO5, 
                                              OTG_FS_DFIFO6,  OTG_FS_DFIFO7,
                                              0                               },
                                            { OTG_HS_DFIFO0,  OTG_HS_DFIFO1, 
                                              OTG_HS_DFIFO2,  OTG_HS_DFIFO3, 
                                              OTG_HS_DFIFO4,  OTG_HS_DFIFO5, 
                                              OTG_HS_DFIFO6,  OTG_HS_DFIFO7, 
                                              OTG_HS_DFIFO8,  OTG_HS_DFIFO9, 
                                              OTG_HS_DFIFO10, OTG_HS_DFIFO11, 
                                              OTG_HS_DFIFO12, OTG_HS_DFIFO13, 
                                              OTG_HS_DFIFO14, OTG_HS_DFIFO15  }};

/* Reserve memory for memory pools */
       U32       USBH0_MPOOL[(USBH0_STM32_SZ_MPOOL+3)>>2];
       U32       USBH1_MPOOL[(USBH1_STM32_SZ_MPOOL+3)>>2];

static BOOL      HW_Accessing   [2]                = { __FALSE };
static USBH_URB *CHURB          [2][OTG_HS_MAX_CH] = { 0 };
static U16       cntInterval    [2][OTG_HS_MAX_CH] = { 0 };
static U8        cntIntervalMax [2][OTG_HS_MAX_CH] = { 0 };
static U16       cntDebounce[2]                    = { 0 };
static U32       calDelay                          =   0  ;
static U32       Port_Discon_Evt[2]                = { 0 };
static U32       Port_Speed[2]                     = { 0 };
static U32       Port_Con[2]                       = { 0 };


/************************** Local Module Functions ****************************/

/***----------------------- DMA Functions ----------------------------------***/

/*------------------------- USBH_STM32_DMA_Enable ------------------------------
 *
 *  Enable the DMA so it can be used for USB
 *
 *  Parameter:              None
 *  Return:                 None
 *----------------------------------------------------------------------------*/

__inline static void USBH_STM32_DMA_Enable (void) {
  RCC->AHB1ENR  |=  (1 << 22);                    /* Enable DMA2 clock, DMA2  */
                                                  /* will be used to load     */
                                                  /* TX FIFOs                 */
}


/*------------------------- USBH_STM32_DMA_Disable -----------------------------
 *
 *  Disable the DMA previoucly used for USB
 *
 *  Parameter:              None
 *  Return:                 None
 *----------------------------------------------------------------------------*/
#if 0
__inline static void USBH_STM32_DMA_Disable (void) {
  RCC->AHB1ENR  &= ~(1 << 22);                    /* Disable DMA2 clock       */
}
#endif


/*------------------------- USBH_STM32_DMA_Stop --------------------------------
 *
 *  Stop the DMA transfer
 *
 *  Parameter:  ctrl:       Controller index (0 = OTG_FS, 1 = OTG_HS)
 *  Return:                 __TRUE = Ok, __FALSE = error
 *----------------------------------------------------------------------------*/

__inline static BOOL USBH_STM32_DMA_Stop (U8 ctrl) {
  S32 tout;
  DMA_Stream_TypeDef *ptr_DMA_Stream;

  if (!ctrl) {
    ptr_DMA_Stream = DMA2_Stream0;
  } else {
    ptr_DMA_Stream = DMA2_Stream1;
  }

  ptr_DMA_Stream->CR = (ctrl << 25);              /* Disable the DMA stream   */
  for (tout = 1010; tout >= 0; tout--) {          /* Wait max 100 ms          */
    if (!(ptr_DMA_Stream->CR & 1))                /* Wait for DMA to disable  */
      break;
    if (!tout) 
      return (__FALSE);
    if (tout <= 10)
      USBH_STM32_Delay_ms (10);
  }

  return (__TRUE);
}


/*------------------------- USBH_STM32_DMA_Start -------------------------------
 *
 *  Start the DMA transfer
 *
 *  Parameter:  ctrl:       Controller index (0 = OTG_FS, 1 = OTG_HS)
 *              ptrDest:    Pointer to Destination addres of transfer
 *              ptrSrc:     Pointer to Source address of transfer
 *              len:        Number of bytes to transfer
 *  Return:                 __TRUE = Ok, __FALSE = error
 *----------------------------------------------------------------------------*/

__inline static BOOL USBH_STM32_DMA_Start (U8 ctrl, U32 *ptrDest, U32 *ptrSrc, U16 len) {
  DMA_Stream_TypeDef *ptr_DMA_Stream;

  if (!ctrl) {
    ptr_DMA_Stream = DMA2_Stream0;
  } else {
    ptr_DMA_Stream = DMA2_Stream1;
  }

  DMA2->LIFCR          = (0x3D << (ctrl*6));      /* Clear DMA2 interrupts    */
  ptr_DMA_Stream->PAR  = (uint32_t)ptrSrc;        /* Load source address      */
  ptr_DMA_Stream->M1AR =  0;                      /* Not used                 */
  ptr_DMA_Stream->M0AR = (uint32_t)ptrDest;       /* Load destination address */
  ptr_DMA_Stream->NDTR = (len+3)/4;               /* Set size of transfer     */
  ptr_DMA_Stream->FCR  =  0;                      /* FIFO not used            */
  ptr_DMA_Stream->CR   = (ctrl << 25);            /* Select channel (CHSEL)   */
  ptr_DMA_Stream->CR  |= (0 << 23) |              /* MBURST = 0               */
                         (0 << 21) |              /* PBURST = 0               */
                         (0 << 19) |              /* CT = 0                   */
                         (0 << 18) |              /* DBM = 0                  */
                         (0 << 16) |              /* Priority Level low (PL=0)*/
                         (0 << 15) |              /* PINCOS = 0               */
                         (2 << 13) |              /* Memory size 32 bits      */
                         (2 << 11) |              /* Peripheral size 32 bits  */
                         (1 << 10) |              /* Memory increment enable  */
                         (1 <<  9) |              /* Peripheral increment en  */
                         (0 <<  8) |              /* CIRC = 0                 */
                         (2 <<  6) |              /* Direction mem-to-mem     */
                         (0 <<  5) |              /* DMA is flow controller   */
                         (0 <<  4) |              /* TCIE = 0                 */
                         (0 <<  3) |              /* HTIE = 0                 */
                         (0 <<  2) |              /* TEIE = 0                 */
                         (0 <<  1) ;              /* DMEIE = 0                */
  ptr_DMA_Stream->CR  |= (1 <<  0) ;              /* Channel enable           */

  return (__TRUE);
}


/*------------------------- USBH_STM32_DMA_Wait --------------------------------
 *
 *  Wait for the DMA transfer to finish and cleanup DMA for next transfer 
 *
 *  Parameter:  ctrl:       Controller index (0 = OTG_FS, 1 = OTG_HS)
 *  Return:                 __TRUE = Ok, __FALSE = error
 *----------------------------------------------------------------------------*/

__inline static BOOL USBH_STM32_DMA_Wait (U8 ctrl) {
  S32 tout;
  DMA_Stream_TypeDef *ptr_DMA_Stream;

