MBronsom/OfflineSWD/Firmware/keil_standard_f103_20200910/RL/USB/Drivers/usbh_stm32f40x.c
  if (!ctrl) {
    ptr_DMA_Stream = DMA2_Stream0;
  } else {
    ptr_DMA_Stream = DMA2_Stream1;
  }

  for (tout = 1010; tout >= 0; tout--) {          /* Wait max 100 ms          */
    if (!(ptr_DMA_Stream->CR & 1) || !(ptr_DMA_Stream->NDTR)) /* If completed */
      break;
    if (!tout) 
      return (__FALSE);
    if (tout <= 10)
      USBH_STM32_Delay_ms (10);
  }
  if (!USBH_STM32_DMA_Stop(ctrl))                 /* Stop the DMA transfer    */
    return (__FALSE);

  return (__TRUE);
}


/***----------------------- Pin Functions ----------------------------------***/

/*------------------------- usbh_stm32_cfg_pin ---------------------------------
 *
 *  Configurate USB pin
 *
 *  Parameter:  port:       Port number   ( A = 0, B = 1, ..)
 *              pin:        Pin number    ( 0 .. 15)
 *              param:      Pin parameter ( 0 ..  1: mode,
 *                                          2      : otype,
 *                                          3 ..  4: ospeed,
 *                                          5 ..  6: pupd,
 *                                          7 .. 10: af
 *                                         11      : output value for GPO mode)
 *  Return:
 *----------------------------------------------------------------------------*/

void usbh_stm32_cfg_pin (U32 port, U32 pin, U32 param) {
  GPIO_TypeDef *gpio;

  if (port >  8) return;
  if (pin  > 15) return;
  gpio  = ((GPIO_TypeDef *) (0x40020000 + 0x400*port));

  RCC->AHB1ENR      |=  (                 1  <<  port);
  if ((param & 3) == 1) {
    if ((param >> 11) & 1) { 
      gpio->BSRRL    =  (                 1 <<   pin);
    } else {
      gpio->BSRRH    =  (                 1 <<   pin);
    }
  }
  gpio->MODER       &= ~(                 3  << (pin<<1));
  gpio->MODER       |=  (((param >> 0) &  3) << (pin<<1));
  gpio->OTYPER      &= ~(                 1  <<  pin);
  gpio->OTYPER      |=  (((param >> 2) &  1) <<  pin);
  gpio->OSPEEDR     &= ~(                 3  << (pin<<1));
  gpio->OSPEEDR     |=  (((param >> 3) &  3) << (pin<<1));
  gpio->PUPDR       &= ~(                 3  << (pin<<1));
  gpio->PUPDR       |=  (((param >> 5) &  3) << (pin<<1));
  gpio->AFR[pin>=8] &= ~(                15  << ((pin&7)<<2));
  gpio->AFR[pin>=8] |=  (((param >> 7) & 15) << ((pin&7)<<2));
}


/*------------------------- usbh_stm32_uncfg_pin -------------------------------
 *
 *  Unconfigurate USB pin (configurate pin as after reset)
 *
 *  Parameter:  port:       Port number (A = 0, B = 1, ..)
 *              pin:        Pin number  (0 .. 15)
 *  Return:
 *----------------------------------------------------------------------------*/

void usbh_stm32_uncfg_pin (U32 port, U32 pin) {
  GPIO_TypeDef *gpio;

  if (port >  8) return;
  if (pin  > 15) return;
  gpio  = ((GPIO_TypeDef *) (0x40020000 + 0x400*port));  

  gpio->MODER       &= ~( 3  << (pin<<1));
  gpio->OTYPER      &= ~( 1  <<  pin);
  gpio->OSPEEDR     &= ~( 3  << (pin<<1));
  gpio->PUPDR       &= ~( 3  << (pin<<1));
  gpio->AFR[pin>=8] &= ~(15  << ((pin&7)<<2));
}


/***----------------------- Channel Functions ------------------------------***/

/*------------------------- USBH_STM32_CH_GetIndexFromCH -----------------------
 *
 *  Get the Index of Channel from it's Address
 *
 *  Parameter:  ctrl:       Controller index (0 = OTG_FS, 1 = OTG_HS)
 *              ptrCH:      Pointer to the Channel
 *  Return:                 Index of the Channel
 *----------------------------------------------------------------------------*/

static U32 USBH_STM32_CH_GetIndexFromCH (U8 ctrl, USBH_STM32_CH *ptrCH) {
  return (ptrCH - (USBH_STM32_CH *)(&((OTG_HS_TypeDef *)OTG[ctrl])->HCCHAR0));
}


/*------------------------- USBH_STM32_CH_GetCHFromIndex -----------------------
 *
 *  Get the Channel Address from it's Index
 *
 *  Parameter:  ctrl:       Controller index (0 = OTG_FS, 1 = OTG_HS)
 *              idx:        Index of the Channel
 *  Return:                 Address of the Channel
 *----------------------------------------------------------------------------*/

static USBH_STM32_CH *USBH_STM32_CH_GetCHFromIndex (U8 ctrl, U32 idx) {
  return ((USBH_STM32_CH *)(&((OTG_HS_TypeDef *)OTG[ctrl])->HCCHAR0) + idx);
}


/*------------------------- USBH_STM32_CH_FindFree -----------------------------
 *
 *  Find a free Channel
 *
 *  Parameter:  ctrl:       Controller index (0 = OTG_FS, 1 = OTG_HS)
 *  Return:                 Pointer to the first free Channel
 *                          (0 = no free Channel is available)
 *----------------------------------------------------------------------------*/

static void *USBH_STM32_CH_FindFree (U8 ctrl) {
  USBH_STM32_CH *ptr_CH;
  U32            i, max_ch;

  ptr_CH = (USBH_STM32_CH *)(&((OTG_HS_TypeDef *)OTG[ctrl])->HCCHAR0);
  max_ch = (ctrl ? OTG_HS_MAX_CH : OTG_FS_MAX_CH);

  for (i = 0; i < max_ch; i++) {
    if (!ptr_CH->HCCHAR) {
      return (ptr_CH);
    }
    ptr_CH++;
  }

  return (0);
}


/*------------------------- USBH_STM32_CH_Disable ------------------------------
 *
 *  Disable the Channel
 *
 *  Parameter:  ctrl:       Controller index (0 = OTG_FS, 1 = OTG_HS)
 *              ptrCH:      Pointer to the Channel
 *  Return:                 __TRUE = Ok, __FALSE = error
 *----------------------------------------------------------------------------*/

static BOOL USBH_STM32_CH_Disable (U8 ctrl, USBH_STM32_CH *ptrCH) {
  S32 tout;

  if (!ptrCH) 
    return (__FALSE);

  ptrCH->HCINTMSK  =  0;
  USBH_STM32_Delay_ms (2);
  if (ptrCH->HCCHAR & USBH_STM32_HCCHAR_CHENA) {
    if (!(ptrCH->HCCHAR & USBH_STM32_HCCHAR_EPDIR) && (ptrCH->HCTSIZ)) {
      if (!USBH_STM32_DMA_Stop(ctrl))
        return (__FALSE);
    }
    ptrCH->HCINT     =  ~USBH_STM32_HCINT_CHH;
    ptrCH->HCCHAR    =  (ptrCH->HCCHAR  |  USBH_STM32_HCCHAR_CHENA);
    USBH_STM32_Delay_ms (2);
    ptrCH->HCCHAR    =  (ptrCH->HCCHAR  & ~USBH_STM32_HCCHAR_CHENA) | USBH_STM32_HCCHAR_CHDIS;
    for (tout = 1010; tout >= 0; tout--) {        /* Wait max 100 ms          */
      if (ptrCH->HCINT & USBH_STM32_HCINT_CHH) 
        break;
      if ((ptrCH->HCCHAR & (USBH_STM32_HCCHAR_CHENA | USBH_STM32_HCCHAR_CHDIS)) == (USBH_STM32_HCCHAR_CHENA | USBH_STM32_HCCHAR_CHDIS)) 
        break;
      if (!tout) {
        return (__FALSE);
      }
      if (tout <= 10)
        USBH_STM32_Delay_ms (10);
    }
  }

  return (__TRUE);
}


/*------------------------- USBH_STM32_CH_TransferEnqueue ----------------------
 *
 *  Enqueue the Transfer
 *
 *  Parameter:  ctrl:       Controller index (0 = OTG_FS, 1 = OTG_HS)
 *              ptrCH:      Pointer to the channel on which transfer will take place
 *              tgl_typ:    Toggle (bit 5..4: bit 5 - force toggle, bit 4 - value) and 
 *                          Packet type (bit 3..0: USBH_PACKET_IN, USBH_PACKET_OUT or USBH_PACKET_SETUP)
 *              buf:        Start of the receive or transmit data buffer
 *              len:        Length of the data to be received or sent
 *  Return:                 __TRUE = Ok, __FALSE = error
 *----------------------------------------------------------------------------*/

static BOOL USBH_STM32_CH_TransferEnqueue (U8 ctrl, USBH_STM32_CH *ptrCH, U32 tgl_typ, U8 *buf, U32 len) {
  U32  hcchar;
  U32  hctsiz;
  U32  hcintmsk;
  U32  mpsiz;
  U32  ch_idx;
  BOOL load_data;

  if (!ptrCH)
    return (__FALSE);

  if (!Port_Con[ctrl])
    return (__FALSE);

  hcchar   = ptrCH->HCCHAR;                       /* Read channel characterist*/
  hctsiz   = ptrCH->HCTSIZ;                       /* Read channel size info   */
  hcintmsk = 0;

